package com.devteam.mikufunbackend.util;

import java.util.Collection;
import java.util.UUID;
import java.util.regex.Pattern;

/**
 * @author Jackisome
 * @date 2021/9/27
 */
public class ParamUtil {
    private static final String simplified  = "䌽锕锿皑嗳蔼霭爱嫒碍暧瑷谙鹌埯铵肮鳌袄媪岙奥骜钯坝罢鲅摆呗败颁坂板钣办绊帮绑谤镑龅宝饱鸨报铇鲍鹎贝狈备钡惫辈鞴贲锛绷绷镚鲾笔币毕闭诐哔荜毙铋筚赑滗跸边笾编鳊贬变缏辩辫标飑骉骠镖飙飚镳表鳔鳖别瘪宾傧滨缤槟镔濒摈殡膑髌鬓饼禀并并拨剥袯钵饽驳钹铂鹁馎鲌镈钸卜补钚财采采参骖残蚕惭惨黪灿仓伧沧苍鸧舱册侧厕恻测层馇锸镲诧钗侪虿觇掺搀婵谗禅馋缠蝉镡产产刬浐谄铲阐蒇冁忏颤伥阊锠鲳长肠苌尝偿鲿厂场怅玚畅钞车砗彻尘陈谌碜闯衬称龀榇谶柽蛏铛赪撑枨诚铖惩骋鸱痴驰迟齿耻饬炽冲冲虫宠铳俦帱绸畴筹踌雠丑刍厨锄雏橱蹰础储处绌触传钏囱疮创怆锤纯莼莼鹑绰辍龊词辞鹚鹚赐从苁枞葱骢聪丛凑辏撺镩蹿窜缞鹾锉错哒达荙跶鞑轪绐带贷单担郸殚瘅箪胆掸诞弹惮当当珰裆筜挡党谠凼砀垱荡荡档鱽导岛捣祷焘盗锝灯邓镫镝籴敌涤觌诋递谛缔颠巅癫点电垫钿淀鲷钓调铞绖谍叠鲽钉顶订饤锭丢铥东岽鸫动冻栋胨斗钭饾窦阇读渎椟牍犊黩独笃赌镀断缎煅锻簖队对兑怼镦吨趸炖钝顿夺铎缍亸饳堕讹锇鹅额轭垩恶饿谔阏腭锷鹗颚鳄鳄儿鸸鲕尔迩饵铒贰发发罚阀珐矾钒烦饭范贩钫鲂访纺飞绯鲱诽废费镄纷坟豮奋偾愤粪鲼丰风沣枫疯砜锋冯缝讽凤赗肤麸凫绂绋韨辐幞呒抚辅讣妇负驸复复赋缚鲋赙鳆钆该赅钙盖干杆尴秆赶鳡绀赣冈刚岗纲钢戆缟镐诰锆纥鸽搁阁镉个铬给亘赓鹒绠鲠宫龚巩唝贡沟钩钩缑构诟购够觏轱鸪毂鹘诂谷钴蛊馉鹄顾锢鲴刮鸹剐诖挂关观鳏馆贯惯掼鹳广犷归妫龟规闺硅鲑轨匦诡刽刿柜贵鳜衮绲辊滚鲧呙埚锅蝈国帼掴馃椁过铪骇顸韩汉闬颔绗颃号颢灏诃阂饸龁颌阖鲄鹖贺鹤恒鸻横轰红纮闳荭鸿黉讧糇后鲎鲘轷胡胡壶鹕浒户护沪鹱鳠华哗骅铧划画话桦婳怀坏欢还环锾阛缳镮缓奂唤换涣焕痪鲩黄锽鳇谎诙咴挥袆晖珲辉汇汇会讳哕浍绘荟诲桧烩贿秽缋阓毁荤阍浑馄诨锪伙钬货获获祸镬讥击叽饥机玑矶鸡迹积绩缉赍赍跻齑羁级极辑鹡几虮挤鱾计记纪际剂哜济继觊蓟霁鲚鲫骥夹浃镓郏荚铗蛱颊贾钾槚价驾戋奸坚歼间艰监笺缄缣鲣鹣鞯鳒拣枧俭茧捡笕减检睑硷裥锏简谫戬碱见饯剑荐贱涧舰渐谏溅践鉴键槛姜将浆螀缰鳉讲奖桨蒋绛酱娇浇骄胶鲛鹪侥挢绞饺矫脚铰搅缴峤轿较阶疖节讦杰诘洁结颉鲒届诫仅卺紧谨锦馑尽尽劲进荩晋烬赆缙觐泾经茎荆惊鲸刭颈净弪径迳胫痉竞靓静镜颎纠鸠阄旧厩鹫驹锔举榉龃讵钜剧惧据飓锯窭屦鹃镌锩桊绢隽决诀珏绝觉谲镢镢军钧皲鲪馂骏咔开锎凯剀垲恺闿铠锴忾龛阚闶钪铐鲓轲疴钶颏颗壳克课骒缂锞垦恳硁铿抠眍库绔喾裤夸块侩郐哙狯脍鲙宽髋诓诳邝圹纩况旷矿贶亏岿窥骙匮愦溃蒉馈篑聩裈锟鹍鲲阃壸扩阔腊蜡镴来崃徕涞莱梾铼赉睐赖濑癞籁兰岚拦栏阑蓝谰澜褴斓篮镧览揽缆榄漤懒烂滥锒阆捞劳唠崂痨铹铑涝耢乐鳓饹缧镭诔垒泪类厘离骊鹂漓缡蓠鲡篱礼里里逦锂鲤鳢历历厉丽励呖坜沥苈枥疠隶俪栎疬轹郦栗砺砾莅粝蛎跞雳俩奁连帘怜涟莲梿联裢鲢镰敛琏脸裣蔹练娈炼恋殓链潋凉辌粮两唡魉谅辆辽疗缭镣鹩钌猎邻临辚鳞凛廪懔檩赁蔺躏灵岭凌铃鸰棂绫龄鲮领刘浏馏骝飗镏鹠镠绺锍鹨龙咙泷茏昽栊珑胧眬砻笼聋陇垄垅拢娄偻喽蒌楼耧蝼髅嵝搂篓瘘镂噜撸卢庐芦垆泸炉栌胪轳鸬舻颅鲈卤卤虏掳鲁橹镥陆录赂辂渌禄滤箓辘鹭氇驴闾榈吕侣稆铝屡缕褛虑绿孪峦挛栾鸾脔滦銮乱锊抡仑伦囵沦纶轮论罗猡脶萝逻椤锣箩骡镙泺络荦骆妈嬷马犸玛码蚂杩骂骂唛吗买荬劢迈麦卖脉颟蛮馒瞒鳗满螨谩缦镘猫牦锚铆贸么么没镅鹛霉镁门扪钔闷焖懑们鹲锰梦弥祢猕谜芈觅幂谧绵黾缅腼面鹋缈庙灭珉缗闵闽悯愍鳘鸣铭谬缪谟馍殁蓦镆谋亩钼镎内纳钠难馕挠铙蛲垴恼脑闹讷呐馁铌鲵拟腻鲇鲶捻辇撵酿鸟茑袅陧聂啮嗫镊镍颞蹑蘖宁咛拧狞柠聍泞纽钮农侬哝浓脓秾驽钕疟傩诺锘讴欧殴瓯鸥呕怄沤盘蹒庞鳑抛狍疱赔锫辔喷鹏纰铍鲏罴骈谝骗缥飘贫嫔频颦评凭苹鲆钋泼颇酦钷颒仆扑铺镤朴谱镨凄栖桤齐脐颀骐骑蛴锜蕲鲯鳍岂启启绮气讫弃荠碛扦迁佥钎牵悭铅谦签骞鹐荨钤钱钳潜浅肷谴缱堑椠呛戗枪玱跄锖锵镪强墙墙嫱蔷樯抢羟襁炝硗跷锹缲乔侨荞桥谯鞒诮窍翘窃惬箧锲亲钦骎嵚锓寝吣揿氢轻倾鲭苘顷请庆穷茕琼鳅虬赇巯区岖诎驱躯趋鸲癯龋阒觑权诠辁铨鳈颧绻劝却悫确阕阙鹊让荛饶桡扰娆绕热认讱纫纴轫韧饪驲绒荣嵘蝾镕铷颥缛软锐闰润洒钑飒萨鳃赛叁毵伞糁馓颡丧骚缫鳋扫涩啬铯穑杀纱刹铩鲨筛晒删姗钐闪陕讪骟缮赡鳝伤殇觞垧赏绱烧绍赊舍厍设慑摄滠绅诜鲹沈审谂婶肾渗瘆声胜渑绳圣尸师诗鸤狮湿酾鲺时识实蚀埘莳鲥驶势视试饰贳适轼铈弑谥释寿兽绶书纾枢摅输赎术树竖数帅闩双骦鹴谁税顺说说烁铄硕纟丝咝鸶缌蛳飔厮锶饲驷松怂耸讼诵颂馊飕锼擞薮苏稣诉肃骕谡鹔虽绥随岁谇孙狲荪损笋缩唢琐锁铊獭鳎挞闼阘骀台台台鲐态钛贪啴摊滩瘫坛昙谈锬谭钽叹赕汤铴镗饧傥烫涛绦绦韬梼绹鼗讨铽腾誊锑绨缇鹈题鳀体屉阗觍条龆鲦粜铫贴铁厅听烃铤颋铜鲖统恸头秃图涂钍团抟颓蜕饨鲀讬饦脱驮驼鸵鼍椭萚箨洼娲袜腽弯湾纨顽挽绾万网辋鳂为为韦围帏沩违闱涠维潍伟伪伪纬苇炜玮诿韪鲔卫硙谓猬温辒鳁纹闻阌稳问鹟瓮挝涡莴窝蜗卧龌乌污邬呜诬钨无吴芜鹀坞妩庑怃鹉务误骛雾鹜诶饻牺锡习袭觋鳛玺铣戏屃系系饩细郄绤阋虾侠峡狭硖辖吓厦纤籼莶铦跹锨鲜闲闲贤咸挦娴衔痫鹇狝显险崄猃蚬藓县岘苋现线线宪馅羡献乡芗厢缃骧镶详响饷飨鲞项枭哓骁绡鸮萧销潇箫蟏嚣晓啸蝎协胁挟谐携撷缬写泻绁亵谢锌衅兴骍陉钘铏讻汹诇鸺馐绣锈锈须须顼虚谞嘘许诩叙绪续溆轩谖悬选癣绚铉镟学泶鸴鳕谑勋勋埙寻驯询浔鲟训讯逊压鸦桠鸭哑痖亚讶垭娅挜氩恹烟阉讠闫严盐阎颜颜兖俨厣魇黡鼹厌觃彦砚艳验谚滟酽谳餍赝鸯扬阳旸杨炀疡钖飏养痒样尧肴峣轺窑谣摇遥瑶飖鳐药鹞爷铘业叶页邺晔烨谒馌靥医祎铱鹥仪诒饴贻遗颐钇舣蚁义亿忆艺议异呓译峄怿绎诣驿轶谊勚缢瘗镒鹝鹢镱阴荫骃铟银龂龈饮隐瘾应莺婴绬锳嘤撄缨罂樱璎鹦鹰茔荥荧莹萤营萦滢蓥潆蝇赢颍颕颖瘿哟佣拥痈镛鳙颙咏涌踊鲬优忧犹邮莜莸铀游鱿鲉铕诱纡于欤鱼娱谀馀渔嵛觎舆与伛屿俣语铻龉驭吁妪饫郁狱钰预谕阈御鹆滪蓣誉鹬鸢鸳渊鹓贠员园圆缘鼋辕橼远愿约岳钥悦钺阅跃粤赟云匀纭芸郧氲陨殒运郓恽晕酝愠缊韫韵蕴臜杂灾载攒趱暂赞錾瓒赃驵脏脏凿枣灶则择泽责啧帻箦赜贼鲗谮缯锃赠揸齄扎札轧闸铡鲊鲝诈栅斋债毡谵鹯鳣斩飐盏崭辗战栈绽骣张涨帐胀账钊诏赵辄蛰谪辙锗这鹧贞针侦浈桢祯诊轸缜阵纼鸩赈镇争征峥挣狰钲睁铮筝证诤郑帧症织栀执职絷踯只只纸轵志制帜质栉挚致贽轾掷铚鸷滞骘觯踬终钟钟肿种众众诌诪辀鸼赒轴纣绉昼荮皱骤诛诸猪铢槠潴橥烛属嘱瞩伫纻苎注贮驻筑铸专砖颛转啭赚馔妆庄桩装壮状骓锥坠缀缒赘谆准浊诼镯兹赀资缁谘辎锱镃龇鲻渍眦综骔踪总偬纵邹驺诹鲰镞诅组躜缵钻鳟";
    private static final String traditional = "綵錒鎄皚噯藹靄愛嬡礙曖璦諳鵪垵銨骯鰲襖媼嶴奧驁鈀壩罷鮁擺唄敗頒阪闆鈑辦絆幫綁謗鎊齙寶飽鴇報鉋鮑鵯貝狽備鋇憊輩韝賁錛繃綳鏰鰏筆幣畢閉詖嗶蓽斃鉍篳贔潷蹕邊籩編鯿貶變緶辯辮標颮驫驃鏢飆飈鑣錶鰾鱉別癟賓儐濱繽檳鑌瀕擯殯臏髕鬢餅稟並併撥剝襏缽餑駁鈸鉑鵓餺鮊鎛鈽蔔補鈈財採埰參驂殘蠶慚慘黲燦倉傖滄蒼鶬艙冊側廁惻測層餷鍤鑔詫釵儕蠆覘摻攙嬋讒禪饞纏蟬鐔產産剗滻諂鏟闡蕆囅懺顫倀閶錩鯧長腸萇嘗償鱨廠場悵瑒暢鈔車硨徹塵陳諶磣闖襯稱齔櫬讖檉蟶鐺赬撐棖誠鋮懲騁鴟癡馳遲齒恥飭熾沖衝蟲寵銃儔幬綢疇籌躊讎醜芻廚鋤雛櫥躕礎儲處絀觸傳釧囪瘡創愴錘純蓴蒓鶉綽輟齪詞辭鶿鷀賜從蓯樅蔥驄聰叢湊輳攛鑹躥竄縗鹺銼錯噠達薘躂韃軑紿帶貸單擔鄲殫癉簞膽撣誕彈憚當噹璫襠簹擋黨讜氹碭壋蕩盪檔魛導島搗禱燾盜鍀燈鄧鐙鏑糴敵滌覿詆遞諦締顛巔癲點電墊鈿澱鯛釣調銱絰諜疊鰈釘頂訂飣錠丟銩東崠鶇動凍棟腖鬥鈄餖竇闍讀瀆櫝牘犢黷獨篤賭鍍斷緞煆鍛籪隊對兌懟鐓噸躉燉鈍頓奪鐸綞嚲飿墮訛鋨鵝額軛堊惡餓諤閼齶鍔鶚顎鱷鰐兒鴯鮞爾邇餌鉺貳發髮罰閥琺礬釩煩飯範販鈁魴訪紡飛緋鯡誹廢費鐨紛墳豶奮僨憤糞鱝豐風灃楓瘋碸鋒馮縫諷鳳賵膚麩鳧紱紼韍輻襆嘸撫輔訃婦負駙復複賦縛鮒賻鰒釓該賅鈣蓋幹桿尷稈趕鱤紺贛岡剛崗綱鋼戇縞鎬誥鋯紇鴿擱閣鎘個鉻給亙賡鶊綆鯁宮龔鞏嗊貢溝鉤鈎緱構詬購夠覯軲鴣轂鶻詁穀鈷蠱餶鵠顧錮鯝颳鴰剮詿掛關觀鰥館貫慣摜鸛廣獷歸媯龜規閨矽鮭軌匭詭劊劌櫃貴鱖袞緄輥滾鯀咼堝鍋蟈國幗摑餜槨過鉿駭頇韓漢閈頷絎頏號顥灝訶閡餄齕頜闔魺鶡賀鶴恆鴴橫轟紅紘閎葒鴻黌訌餱後鱟鮜軤衚鬍壺鶘滸戶護滬鸌鱯華嘩驊鏵劃畫話樺嫿懷壞歡還環鍰闤繯鐶緩奐喚換渙煥瘓鯇黃鍠鰉謊詼噅揮褘暉琿輝匯彙會諱噦澮繪薈誨檜燴賄穢繢闠毀葷閽渾餛諢鍃夥鈥貨獲穫禍鑊譏擊嘰饑機璣磯雞跡積績緝齎賫躋齏羈級極輯鶺幾蟣擠魢計記紀際劑嚌濟繼覬薊霽鱭鯽驥夾浹鎵郟莢鋏蛺頰賈鉀檟價駕戔姦堅殲間艱監箋緘縑鰹鶼韉鰜揀梘儉繭撿筧減檢瞼鹼襇鐧簡譾戩堿見餞劍薦賤澗艦漸諫濺踐鑒鍵檻薑將漿螿韁鱂講獎槳蔣絳醬嬌澆驕膠鮫鷦僥撟絞餃矯腳鉸攪繳嶠轎較階癤節訐傑詰潔結頡鮚屆誡僅巹緊謹錦饉儘盡勁進藎晉燼贐縉覲涇經莖荊驚鯨剄頸凈弳徑逕脛痙競靚靜鏡熲糾鳩鬮舊廄鷲駒鋦舉櫸齟詎鉅劇懼據颶鋸窶屨鵑鐫錈棬絹雋決訣玨絕覺譎钁鐝軍鈞皸鮶餕駿哢開鐦凱剴塏愷闓鎧鍇愾龕闞閌鈧銬鮳軻痾鈳頦顆殼剋課騍緙錁墾懇硜鏗摳瞘庫絝嚳褲誇塊儈鄶噲獪膾鱠寬髖誆誑鄺壙纊況曠礦貺虧巋窺騤匱憒潰蕢饋簣聵褌錕鶤鯤閫壼擴闊臘蠟鑞來崍徠淶萊棶錸賚睞賴瀨癩籟蘭嵐攔欄闌藍讕瀾襤斕籃鑭覽攬纜欖灠懶爛濫鋃閬撈勞嘮嶗癆鐒銠澇耮樂鰳餎縲鐳誄壘淚類釐離驪鸝灕縭蘺鱺籬禮裡裏邐鋰鯉鱧歷曆厲麗勵嚦壢瀝藶櫪癘隸儷櫟癧轢酈慄礪礫蒞糲蠣躒靂倆奩連簾憐漣蓮槤聯褳鰱鐮斂璉臉襝蘞練孌煉戀殮鏈瀲涼輬糧兩啢魎諒輛遼療繚鐐鷯釕獵鄰臨轔鱗凜廩懍檁賃藺躪靈嶺淩鈴鴒欞綾齡鯪領劉瀏餾騮飀鎦鶹鏐綹鋶鷚龍嚨瀧蘢曨櫳瓏朧矓礱籠聾隴壟壠攏婁僂嘍蔞樓耬螻髏嶁摟簍瘺鏤嚕擼盧廬蘆壚瀘爐櫨臚轤鸕艫顱鱸鹵滷虜擄魯櫓鑥陸錄賂輅淥祿濾籙轆鷺氌驢閭櫚呂侶穭鋁屢縷褸慮綠孿巒攣欒鸞臠灤鑾亂鋝掄侖倫圇淪綸輪論羅玀腡蘿邏欏鑼籮騾鏍濼絡犖駱媽嬤馬獁瑪碼螞榪罵駡嘜嗎買蕒勱邁麥賣脈顢蠻饅瞞鰻滿蟎謾縵鏝貓氂錨鉚貿麽麼沒鎇鶥黴鎂門捫鍆悶燜懣們鸏錳夢彌禰獼謎羋覓冪謐綿黽緬靦麵鶓緲廟滅瑉緡閔閩憫湣鰵鳴銘謬繆謨饃歿驀鏌謀畝鉬鎿內納鈉難饢撓鐃蟯堖惱腦鬧訥吶餒鈮鯢擬膩鮎鯰撚輦攆釀鳥蔦裊隉聶嚙囁鑷鎳顳躡櫱寧嚀擰獰檸聹濘紐鈕農儂噥濃膿穠駑釹瘧儺諾鍩謳歐毆甌鷗嘔慪漚盤蹣龐鰟拋麅皰賠錇轡噴鵬紕鈹鮍羆駢諞騙縹飄貧嬪頻顰評憑蘋鮃釙潑頗醱鉕頮僕撲鋪鏷樸譜鐠淒棲榿齊臍頎騏騎蠐錡蘄鯕鰭豈啟啓綺氣訖棄薺磧扡遷僉釺牽慳鉛謙簽騫鵮蕁鈐錢鉗潛淺膁譴繾塹槧嗆戧槍瑲蹌錆鏘鏹強牆墻嬙薔檣搶羥繈熗磽蹺鍬繰喬僑蕎橋譙鞽誚竅翹竊愜篋鍥親欽駸嶔鋟寢唚撳氫輕傾鯖檾頃請慶窮煢瓊鰍虯賕巰區嶇詘驅軀趨鴝臒齲闃覷權詮輇銓鰁顴綣勸卻愨確闋闕鵲讓蕘饒橈擾嬈繞熱認訒紉紝軔韌飪馹絨榮嶸蠑鎔銣顬縟軟銳閏潤灑鈒颯薩鰓賽叄毿傘糝饊顙喪騷繅鰠掃澀嗇銫穡殺紗剎鎩鯊篩曬刪姍釤閃陝訕騸繕贍鱔傷殤觴坰賞緔燒紹賒捨厙設懾攝灄紳詵鯵瀋審諗嬸腎滲瘮聲勝澠繩聖屍師詩鳲獅濕釃鯴時識實蝕塒蒔鰣駛勢視試飾貰適軾鈰弒謚釋壽獸綬書紓樞攄輸贖術樹豎數帥閂雙驦鸘誰稅順說説爍鑠碩糹絲噝鷥緦螄颸廝鍶飼駟鬆慫聳訟誦頌餿颼鎪擻藪蘇穌訴肅驌謖鷫雖綏隨歲誶孫猻蓀損筍縮嗩瑣鎖鉈獺鰨撻闥闒駘臺檯颱鮐態鈦貪嘽攤灘癱壇曇談錟譚鉭嘆賧湯鐋鏜餳儻燙濤絛縧韜檮綯鞀討鋱騰謄銻綈緹鵜題鯷體屜闐覥條齠鰷糶銚貼鐵廳聽烴鋌頲銅鮦統慟頭禿圖塗釷團摶頹蛻飩魨託飥脫馱駝鴕鼉橢蘀籜窪媧襪膃彎灣紈頑輓綰萬網輞鰃為爲韋圍幃溈違闈潿維濰偉偽僞緯葦煒瑋諉韙鮪衛磑謂蝟溫轀鰮紋聞閿穩問鶲甕撾渦萵窩蝸臥齷烏汙鄔嗚誣鎢無吳蕪鵐塢嫵廡憮鵡務誤騖霧鶩誒餏犧錫習襲覡鰼璽銑戲屭係繫餼細郤綌鬩蝦俠峽狹硤轄嚇廈纖秈薟銛躚鍁鮮閑閒賢鹹撏嫻銜癇鷳獮顯險嶮獫蜆蘚縣峴莧現線綫憲餡羨獻鄉薌廂緗驤鑲詳響餉饗鯗項梟嘵驍綃鴞蕭銷瀟簫蠨囂曉嘯蠍協脅挾諧攜擷纈寫瀉紲褻謝鋅釁興騂陘鈃鉶訩洶詗鵂饈繡鏽銹須鬚頊虛諝噓許詡敘緒續漵軒諼懸選癬絢鉉鏇學澩鴬鱈謔勛勳塤尋馴詢潯鱘訓訊遜壓鴉椏鴨啞瘂亞訝埡婭掗氬懨煙閹訁閆嚴鹽閻顏顔兗儼厴魘黶鼴厭覎彥硯艷驗諺灩釅讞饜贗鴦揚陽暘楊煬瘍鍚颺養癢樣堯餚嶢軺窯謠搖遙瑤颻鰩藥鷂爺鋣業葉頁鄴曄燁謁饁靨醫禕銥鷖儀詒飴貽遺頤釔艤蟻義億憶藝議異囈譯嶧懌繹詣驛軼誼勩縊瘞鎰鷊鷁鐿陰蔭駰銦銀齗齦飲隱癮應鶯嬰緓鍈嚶攖纓罌櫻瓔鸚鷹塋滎熒瑩螢營縈瀅鎣瀠蠅贏潁頴穎癭喲傭擁癰鏞鱅顒詠湧踴鯒優憂猶郵蓧蕕鈾遊魷鮋銪誘紆於歟魚娛諛餘漁崳覦輿與傴嶼俁語鋙齬馭籲嫗飫鬱獄鈺預諭閾禦鵒澦蕷譽鷸鳶鴛淵鵷貟員園圓緣黿轅櫞遠願約嶽鑰悅鉞閱躍粵贇雲勻紜蕓鄖氳隕殞運鄆惲暈醞慍縕韞韻蘊臢雜災載攢趲暫贊鏨瓚贓駔髒臟鑿棗竈則擇澤責嘖幘簀賾賊鰂譖繒鋥贈摣齇紮劄軋閘鍘鮓鮺詐柵齋債氈譫鸇鱣斬颭盞嶄輾戰棧綻驏張漲帳脹賬釗詔趙輒蟄謫轍鍺這鷓貞針偵湞楨禎診軫縝陣紖鴆賑鎮爭徵崢掙猙鉦睜錚箏證諍鄭幀癥織梔執職縶躑衹隻紙軹誌製幟質櫛摯緻贄輊擲銍鷙滯騭觶躓終鐘鍾腫種眾衆謅譸輈鵃賙軸紂縐晝葤皺驟誅諸豬銖櫧瀦櫫燭屬囑矚佇紵苧註貯駐築鑄專磚顓轉囀賺饌妝莊樁裝壯狀騅錐墜綴縋贅諄準濁諑鐲茲貲資緇諮輜錙鎡齜鯔漬眥綜騌蹤總傯縱鄒騶諏鯫鏃詛組躦纘鑽鱒";
    private static final String[] simps = simplified.split("");
    private static final String[] trads = traditional.split("");

    public static boolean isNotEmpty(String string) {
        return string != null && string.length() != 0;
    }

    public static boolean isNotEmpty(Collection collection) {
        return collection != null && collection.size() != 0;
    }

    public static boolean isLegalDate(String date) {
        String DATE_REGEX = "^((19|20)[0-9]{2})-((0?2-((0?[1-9])|([1-2][0-9])))|(0?(1|3|5|7|8|10|12)-((0?[1-9])|([1-2][0-9])|(3[0-1])))|(0?(4|6|9|11)-((0?[1-9])|([1-2][0-9])|30)))$";
        return Pattern.matches(DATE_REGEX, date);
    }

    public static boolean isLegalTime(String time) {
        String TIME_REGEX = "^([0-1][0-9]|2[0-3]):([0-5][0-9]):([0-5][0-9])$";
        return Pattern.matches(TIME_REGEX, time);
    }

    public static String getUUID() {
        return UUID.randomUUID().toString();
    }

    public static String getFileDirectory(String uuid) {
        return "/docker/resource/" + uuid;
    }

    public static boolean validateType(String type) {
        return (type != null) && (type.equals("mkv") || type.equals("mp4"));
    }

    /**
     * 繁体转简体
     * @param text
     * @return
     */
    public static String traditionalToSimplified(String text) {
        for(int i = 0; i < trads.length; i++) {
            if(text.contains(trads[i])) {
                text = text.replaceAll(trads[i], simps[i]);
            }
        }

        return text;
    }

    /**
     * 简体转繁体
     * 未解决一个简体对应多个繁体的情况，只是转为排在前面的繁体字
     * @param text
     * @return
     */
    public static String simplifiedToTraditional(String text) {
        for(int i = 0; i < simps.length; i++) {
            if(text.contains(simps[i])) {
                text = text.replaceAll(simps[i], trads[i]);
            }
        }

        return text;
    }
}
